Tekla Open API Reference for Tekla Structures 2025
RebarCrankingNullable.CrankedOffset Property
 Gets or sets the cranked offset.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double? CrankedOffset { get; set; }
Public Property CrankedOffset As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
See Also
Reference
RebarCrankingNullable Class
Tekla.Structures.Model Namespace